ruvnet/wifi-densepose/firmware/esp32-csi-node/sdkconfig.defaults.esp32cam-dual
# RuView ESP32-CAM dual firmware — classic ESP32 / AI Thinker style boards.
# Keeps RuView CSI UDP telemetry and exposes OV2640 MJPEG endpoints on port 8032:
#   http://<node-ip>:8032/cam
#   http://<node-ip>:8032/cam.jpg
#   http://<node-ip>:8032/stream
#   http://<node-ip>:8032/cam/status
#
# Build:
#   idf.py -B build-esp32cam-dual \
#     -D SDKCONFIG=build-esp32cam-dual/sdkconfig \
#     -D SDKCONFIG_DEFAULTS=sdkconfig.defaults.esp32cam-dual \
#     set-target esp32 build

CONFIG_IDF_TARGET="esp32"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"

CONFIG_ESP_WIFI_CSI_ENABLED=y
# CONFIG_CSI_MOCK_ENABLED is not set

# AI Thinker ESP32-CAM modules normally include PSRAM. Keep booting if a clone
# lacks PSRAM; the camera module falls back to a single DRAM frame buffer.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# No display/audio/WASM on ESP32-CAM; preserve RAM for WiFi CSI + camera.
# CONFIG_DISPLAY_ENABLE is not set
# CONFIG_BATTERY_MONITOR_ENABLE is not set
# CONFIG_WASM_ENABLE is not set

CONFIG_ESP32CAM_DUAL_FIRMWARE=y
CONFIG_ESP32CAM_STREAM_FPS=4
CONFIG_ESP32CAM_FRAME_QVGA=y
CONFIG_ESP32CAM_JPEG_QUALITY=14
CONFIG_ESP32CAM_XCLK_FREQ_HZ=10000000

CONFIG_CSI_NODE_ID=3
CONFIG_CSI_TARGET_IP="192.168.1.100"
CONFIG_CSI_TARGET_PORT=5005
CONFIG_CSI_WIFI_SSID="wifi-densepose"
CONFIG_CSI_WIFI_PASSWORD=""
CONFIG_CSI_WIFI_CHANNEL=6

CONFIG_EDGE_TIER=2
CONFIG_EDGE_VITAL_INTERVAL_MS=1000
CONFIG_EDGE_TOP_K=8
CONFIG_EDGE_FALL_THRESH=15000
CONFIG_EDGE_POWER_DUTY=100

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=8192
